app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])
    if @article.update_attributes(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "name" = ?, "author_name" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["name", "Devise it"], ["author_name", "Jon"], ["updated_at", "2017-11-15 20:10:24.145552"], ["id", 2]]